{
    "recipes": {
        "one": {
            "uploader": "user1",
            "name": "Tuna Sandwitch",
            "desc": "This is a really great tuna salad recipe I got from a friend who used it in her catering service business many years ago. The secret ingredients are the curry and Parmesan cheese! Odd combinations but this makes a terrific tuna sandwich! She used it for an appetizer with gourmet crackers and people always wanted her recipe. I have never tasted another tuna salad quite like this one, and it has been my favorite recipe for tuna salad for many, many years.",
            "ingredients": [
                "1 (7 ounce) can white tuna, drained and flaked",
                "6 tablespoons mayonnaise or salad dressing",
                "1 tablespoon Parmesan cheese",
                "3 tablespoons sweet pickle relish",
                "1/8 teaspoon dried minced onion flakes",
                "1/4 teaspoon curry powder1 tablespoon dried parsley",
                "1 teaspoon dried dill weed",
                "1 pinch garlic powder"
            ],
            "time": {
                "prep": 10,
                "cook": 10
            },
            "yield": 4,
            "directions": [
                "In a medium bowl, stir together the tuna, mayonnaise, Parmesan cheese, and onion flakes. Season with curry powder, parsley, dill and garlic powder. Mix well and serve with crackers or on a sandwich."
            ]
        },
        "two": {
            "uploader": "",
            "name": "Lorraine's Club Sandwich",
            "desc": "Lorraine's Club Sandwich",
            "ingredients": [
                "2 slices bacon",
                "3 slices bread, toasted",
                "3 tablespoons mayonnaise",
                "2 leaves lettuce",
                "2 (1 ounce) slices cooked deli turkey breast",
                "2 slices tomato"
            ],
            "time": {
                "prep": 5,
                "cook": 5
            },
            "yield": 1,
            "directions": [
                "Place bacon in a heavy skillet. Cook over medium high heat until evenly brown. Drain on paper towels.",
                "Spread each slice of bread with mayonnaise. On one slice of toast, place the turkey and lettuce. Cover with a slice of toast, then the bacon and tomato. Top with last slice of toast."
            ]
        },
        "three": {
            "uploader": "",
            "name": "Beef and Swiss Wrap",
            "desc": "Using multi-grain wraps with thin slices of roast beef and cheese along with veggies makes this a healthy lunch on the go.",
            "ingredients": [
                "2 multi grain wraps",
                "2 tablespoons Neufchatel cheese",
                "2 leaves romaine lettuce1 cup fresh spinach",
                "6 slices deli sliced roast beef",
                "2 slices reduced-fat Swiss cheese6 cherry tomatoes, halved"
            ],
            "time": {
                "prep": 5,
                "cook": 5
            },
            "yield": 2,
            "directions": [
                "Heat the wraps in the microwave on High for 30 seconds.",
                "On the right side of one wrap (the side that will fold in last), spread 1 tablespoon Neufchatel cheese about 2/3 of the way down that side. Layer half of the romaine, spinach, beef, Swiss cheese, and tomatoes in the center of the wrap, leaving 1/3 of the wrap open at the bottom. Fold that third up over the bottom of your fillings, then fold in the left side and roll toward the right, letting the Neufchatel seal the wrap together. Repeat with the second wrap."
            ]
        },
        "four": {
            "uploader": "",
            "name": "Zesty Quinoa Salad",
            "desc": "This bright and colorful salad is a great summertime recipe.",
            "ingredients": [
                "1 cup quinoa",
                "2 cups water",
                "1/4 cup extra-virgin olive oil",
                "2 limes, juiced",
                "2 teaspoons ground cumin",
                "1 teaspoon salt",
                "1/2 teaspoon red pepper flakes, or more to taste",
                "1 1/2 cups halved cherry tomatoes",
                "1 (15 ounce) can black beans, drained and rinsed",
                "5 green onions, finely chopped",
                "1/4 cup chopped fresh cilantro"
            ],
            "time": {
                "prep": 20,
                "cook": 10
            },
            "yield": 6,
            "directions": [
                "Bring quinoa and water to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until quinoa is tender and water has been absorbed, 10 to 15 minutes. Set aside to cool.",
                "Whisk olive oil, lime juice, cumin, 1 teaspoon salt, and red pepper flakes together in a bowl.",
                "Combine quinoa, tomatoes, black beans, and green onions together in a bowl. Pour dressing over quinoa mixture; toss to coat. Stir in cilantro; season with salt and black pepper. Serve immediately or chill in refrigerator."
            ]
        },
        "five": {
            "uploader": "",
            "name": "Basic Italian Bean Soup",
            "desc": "Simple and basic Italian bean soup. Great for a quick fix during the week. My Italian mother-in-law rattled this one out to me over the phone years ago.",
            "ingredients": [
                "olive oil",
                "1 large onion, diced2 cloves garlic, or more to taste,",
                "2 cups tomato sauce,",
                "24 ounces prepared cannellini beans",
                "1 tablespoon dried basil",
                "1/2 teaspoon oregano",
                "salt and ground black pepper to taste"
            ],
            "time": {
                "prep": 10,
                "cook": 15
            },
            "yield": 4,
            "directions": [
                "Heat olive oil in a pot over medium-high heat. Cook and stir onion in hot oil until tender, about 5 minutes; add garlic and continue cooking until fragrant, 1 to 2 minutes more.",
                "Pour tomato sauce into the pot; stir. Add cannelini beans, basil, oregano, salt, and pepper. Bring the mixture to a simmer, reduce heat to medium-low, and cook until the beans are hot, 5 to 7 minutes more."
            ]
        },
        "six": {
            "uploader": "",
            "name": "Grilled Chicken Salad Sandwich",
            "desc": "This is a great way to use leftover grilled chicken breasts from dinner the night before. I like it on wheat. My husband likes it on sourdough.",
            "ingredients": [
                "1 cup mayonnaise",
                "1/8 teaspoon ground black pepper",
                "1/8 teaspoon garlic powder",
                "1/8 teaspoon celery salt",
                "4 cups chopped leftover grilled chicken",
                "2 celery stalks, sliced",
                "1/2 cup sweetened dried cranberries",
                "2/3 cup salted cashews",
                "8 slices bread, toasted",
                "4 tablespoons mayonnaise",
                "4 large red leaf lettuce leaves,",
                "1 ripe tomato, sliced"
            ],
            "time": {
                "prep": 10,
                "cook": 5
            },
            "yield": 4,
            "directions": [
                "Whisk together 1 cup of mayonnaise, pepper, garlic powder, and celery salt until combined. Combine the chicken, celery, cranberries, and cashews in a large bowl. Pour the mayonnaise mixture over the chicken mixture and stir until evenly combined.",
                "Spread 1/2 tablespoon of mayonnaise on each slice of toasted bread. Divide the chicken salad between four of the slices of toast; top each with a lettuce leaf and a slice of tomato. Complete each sandwich with the remaining toast slices."
            ]
        },
        "seven": {
            "uploader": "",
            "name": "Vegetarian Chickpea Sandwich Filling",
            "desc": "Serve this tasty sandwich spread on crusty whole grain rolls or pita bread, with lettuce and tomato. Other raw, chopped vegetables can be substituted for the celery. Your favorite salad dressing can be substituted for the mayo",
            "ingredients": [
                "1 (19 ounce) can garbanzo beans, drained and rinsed",
                "1 stalk celery, chopped",
                "1/2 onion, chopped1 tablespoon mayonnaise",
                "1 tablespoon lemon juice",
                "1 teaspoon dried dill weed",
                "salt and pepper to taste"
            ],
            "time": {
                "prep": 10,
                "cook": 10
            },
            "yield": 3,
            "directions": [
                "Drain and rinse chickpeas. Pour chickpeas into a medium size mixing bowl and mash with a fork. Mix in celery, onion, mayonnaise (to taste), lemon juice, dill, salt and pepper to taste."
            ]
        },
        "eight": {
            "uploader": "",
            "name": "Quinoa Black Bean Burgers",
            "desc": "These vegetarian burgers are delicious! Your carnivorous friends will be impressed. My favorite way to serve is on a whole-wheat bun with garlic-lemon mayonnaise, fresh raw spinach, sliced tomato, and caramelized onions!",
            "ingredients": [
                "1 (15 ounce) can black beans, rinsed and drained",
                "1/4 cup quinoa",
                "1/2 cup water",
                "1/2 cup bread crumbs",
                "1/4 cup minced yellow bell pepper",
                "2 tablespoons minced onion1 large clove garlic, minced",
                "1 1/2 teaspoons ground cumin",
                "1/2 teaspoon salt",
                "1 teaspoon hot pepper sauce (such as Frank's RedHot®)",
                "1 egg",
                "3 tablespoons olive oil"
            ],
            "time": {
                "prep": 25,
                "cook": 10
            },
            "yield": 5,
            "directions": [
                "Bring the quinoa and water to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until the quinoa is tender and the water has been absorbed, about 15 to 20 minutes.",
                "Roughly mash the black beans with a fork leaving some whole black beans in a paste-like mixture.",
                "Mix the quinoa, bread crumbs, bell pepper, onion, garlic, cumin, salt, hot pepper sauce, and egg into the black beans using your hands.",
                "Form the black bean mixture into 5 patties.",
                "Heat the olive oil in a large skillet.",
                "Cook the patties in the hot oil until heated through, 2 to 3 minutes per side."
            ]
        }
    },
    "users" : {
        "QIAQhSeVfMVFLq7DXKYGesBPoXc2" : {
            "created" : "2019-03-12T17:13:02",
            "email" : "wooi@oregonstate.edu",
            "uid" : "QIAQhSeVfMVFLq7DXKYGesBPoXc2"
        },
        "RqifaMvKUWeQnHPkvMSphaJ1HCI2" : {
            "created" : "2019-03-12T17:13:11",
            "email" : "iglenwoo@gmail.com",
            "uid" : "RqifaMvKUWeQnHPkvMSphaJ1HCI2"
        }
    }
}
